practice-for-ch-rails-goal-app-long-practice-main/practice-for-ch-rails-goal-app-long-practice-main/goal-app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-10-04 20:15:44.614309"], ["id", 2]]
---
    def reset_session_token
        self.session_token = self.generate_session_token
        self.save!