practice-for-ch-rails-goal-app-long-practice-main/practice-for-ch-rails-goal-app-long-practice-main/goal-app/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def current_user
        @current_user ||= User.find(session: session[:session_token])